<?php
	$news_feed = [
		['heading' => 'Дерменджиев пред dsport: Ивелин Попов е изключително необходим, ще говорим след мача с Беларус', 'date' => '02.02.2020  20:15', 'content' => 'Националният селекционер Георги Дерменджиев даде интервю пред Дарик и dsport.bg по време на престоя му в Турция. Специалистът и неговият екип обикалят лагерите на родните отбори, които играят контроли и тренират.

			"Ние като специалисти знаем добре в какъв етап от подготовката се намират отборите ни. Той е ранен, но исках да видим набелязаните футболисти на какво ниво се намират. Не е моя работа да правя анализи на играта на отборите, но има разлика. За нас присъствието е много ползотворно. Искам психически да се въздейства върху тях. Тепърва ще знаем колко дълго ще отсъства Тодор Неделев, който се контузи и е опериран. Смятам, че формата на играчите за този етап на подготовката е нормална", отбеляза опитният специалист.
			"Винаги съм искал да бъдем позитивно настроени. Искам да си уважаваме играчите. Ние много добре си знаем нивото. Имаме определен шанс и знам, че българският фен иска да види отбора си на европейски форум. Сигурен съм, че феновете ще ни подкрепят истински. Сигурен съм, че играчите ще се раздадат докрай, а вече каквото сабия покаже, както се казва", добави Георги Дерменджиев.'],
		['heading' => 'Аякс взе дербито с ПСВ', 'date' => '02.02.2020  20:02', 'content' => 'Аякс спечели дербито на Нидерландия срещу ПСВ Айндховен. Двубоят от 21-ия кръг на местното първенство завърши с минимален успех за домакините от Амстердам с 1:0. Автор на голът стана Куинси Промес. По този начин Аякс продължава да е лидер в класирането с 50 точки - на 3 от АЗ Алкмаар. ПСВ пък са на пета позиция с 36.

		Аякс поведе в резултата в 35-ата минута с гол на Промес. Офанзивният футболист се възползва от отлично подаване на Дони ван де Беек и прати топката в мрежата на гостите от Айндховен. След почивката ддвата тима си размениха по няколко опасни атаки, но до нов гол така и не се стигна. '],
		['heading' => 'Хетафе си тръгна с трите точки от Билбао', 'date' => '02.02.2020  19:14', 'content' => 'Хетафе победи Атлетик Билбао с 2:0 като гост в среща от 22-ия кръг на Ла Лига. Двете попадения бяха отбелязани в края и началото на двете полувремена. Автори на головете бяха Дамиан Суарес и Хайме Мата.

			Спечелените три точки връщат Хетафе в топ 3, макар и временно. Тимът е с актив от 39 точки, на 1 пред четвъртия Севиля, но андалусийците са с мач по-малко. Малко по-късно в неделния ден Севиля ще се изправи срещу Алавес.

			Атлетик Билбао записа седми мач без победа в Ла Лига. Преди началото на днешния двубой срещу Хетафе „червено-белите“ имаха 5 поредни равенства в испанския шампионат.

			Още в 4-ата минута гостите пропуснаха чудесна възможност да поведат в резултата. Топката бе центрирана към Матиас Оливера Мирамонтес, който засече с глава, но ударът му премина покрай вратата.

			Десетина минути преди края на първата част Хетафе поведе. Страхотно разиграване с по едно докосване между Хайме Мата, Дейверсон и Дамиан Суарес матира защитата на Атлетик Билбао. Последният от изброените получи на границата на наказателното поле, залъга защитник и с прецизен удар завърши за 1:0.

			Пет минути след почивката, след намеса на ВАР, Хетафе получи правото да изпълни дузпа. Защитникът на Билбао Иниго Леке игра с ръка в наказателното поле. Зад топката застана Хайме Мата, който не сбърка и удвои аванса на Хетафе – 2:0.'],
			['heading' => 'Ница излъга Лион в мач с два червени картона', 'date' => '02.02.2020  18:25', 'content' => 'Ница победи Лион с 2:1 в мач от 22-ия кръг на Лига 1. Двубоят бе белязан и от два червени картона, които бяха дадени на играчи на двата тима. След успеха Лион събра 32 точки и се намира на 8-мо място във временното класиране. Ница пък заема шеста позиция също с 32 точки.

				Мачът започна много лошо за гостите от Лион, които останаха с човек по-малко на терена още в 22-ата минута. Бранителят Фернандо Маркал бе изгонен, след като повали футболист на Ница малко преди наказателното поле на "хлапетата". В крайна сметка ирачите на домакините не успяха да се възползват от ситуацията. В 33-ата минута обаче Ница поведе. Попадението за тима бе дело на Каспер Долберг, който се разписа с плътен удар от средно разстояние. В даденото от съдията продължение на първото полувреме обаче Лион изненадващо изравни. Попадението бе дело на Карл Токо Екамби, който отбеляза след отлично подаване на Максуел Корне. В заключителните секунди на продължението, което бе 8-минутно, Ница остана с човек по-малко. Адам Оунас бе озгонен, след като реагира много остро на съдийско решение. В средата на второто полувреме Ница все пак вкара втори гол чрез Каспер Долберг, като по този начин датчанина донесе трите точки на своя тим.'],
			['heading' => 'Изпусната дузпа и дебютант донесоха победата на Тотнъм срещу Ман Сити', 'date' => '02.02.2020  20:25', 'content' => 'Тотнъм победи Манчестър Сити с 2:0 като домакин в дербито на 25-ия кръг на Висшата лига. През първите 45 минути „гражданите“ бяха по-добри на терена от своя съперник, но пропуснаха някои златни възможности да отбележат гол. В края на полувремето Илкай Гюндоган пропусна от бялата точка.

През втората част Сити остана с човек по-малко. Червен картон бе показан на Олександър Зинченко. Минути след това дебютантът в редиците на Тотнъм Стивън Бергвайн и Хьон-Мин Сон се разписаха във вратата на Едерсон и дадоха комфортна преднина на лондончани.

След загубата Манчестър Сити остава на второто място, на 22 точки зад лидера Ливърпул. Тотнъм е пети с 37 точки, на четири от топ 4.

Само 6 минути след началото на мача, изиграл се на "Тотнъм Стейдиъм", Деле Али бе изведен с дълго подаване. Полузащитникът овладя добре и стреля, но вратарят Едерсон демонстрира чудесен рефлекс и успя да отрази.

В 10-ата минута Рахим Стърлинг бе изведен в наказателното поле, той изпревари Серж Орие, но преди да нанесе удар бе повален на земята. Главният съдия Майк Дийн обаче отсъди удар от вратата, въпреки претенциите на „гражданите“ за дузпа.

Две минути по-късно Стърлинг влезе опасно с бутоните в глезена на Деле Али. ВАР разгледа ситуацията за евентуален директен черен картон, в крайна сметка футболистът на Сити се размина само с официално предупреждение.'],
	];
?>

<!DOCTYPE html>
<html lang="bg-Bg">
<head>
	<title>Враца Софтуер - Домашно PHP Strings</title>
	<link rel="stylesheet" type="text/css" href="../styles/style.css">
</head>
<body>
	<div id="container">
		<div id="header_left">
		</div>
		<div id="header_right">
		</div>
		<div id="sidebar_left">
		</div>
		<div id="sidebar_right">
			<h3>
				Домашно - PHP Strings
			</h3>
			<ul>
				<li>
					<a href="../index.php">Задача 1</a>
				</li>
				<li>
					Задача 2
				</li>							
			</ul>
		</div>
		<div id="content">
			<div id="content_top_second">
				<h4>Задача 2</h4>
				Създайте многомерен масив, съдържащ данни за новинарски сайт - заглавие на новина, съдържание и дата. Да се направи страница, която отпечатва последните 5 новини като показва тяхното заглавие, дата и първите 60 символа от съдържанието.
							
			</div>
			<div id="content_bottom_second">
				<?php
					foreach ($news_feed as $news) {
						echo $news['heading'];
						echo '<br>';
						echo $news['date'];
						echo '<br>';
						echo substr($news['content'], 0, 60) . '...';
						echo '<p>';
					}
				?>
			</div>
		</div>
	</div>	
</body>
</html>